; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v3)
             (pred_3 ?v2 ?v11)
             (pred_9 ?v10 ?v11)
             (pred_5 ?v7 ?v10 )
	     (pred_8 ?v10)
             (pred_7 ?v8)
             (pred_12 ?v2)
             (pred_2 ?v11)
             (pred_11 ?v10)
             (pred_6 ?v2)
             (pred_10 ?v10)
             (pred_1 ))



(:action op_1
:parameters (?v4 ?v9 ?v13 ?v12)
:precondition (and (pred_7 ?v4) (pred_7 ?v9) (pred_12 ?v13) (pred_2 ?v12)
          (pred_4 ?v4 ?v9) (pred_3 ?v13 ?v12)
                   (pred_9 ?v9 ?v12) (pred_8 ?v4) 
                   (pred_11 ?v9) (pred_6 ?v13))
:effect (and  (pred_10 ?v9) (not (pred_11 ?v9))))


(:action op_3
:parameters (?v4 ?v1)
:precondition (and (pred_7 ?v4) (pred_7 ?v1)
               (pred_8 ?v4) (pred_4 ?v4 ?v1) (pred_10 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v4))))

(:action op_5
:parameters (?v4 ?v13)
:precondition (and (pred_7 ?v4) (pred_12 ?v13) 
                  (pred_8 ?v4) (pred_5 ?v13 ?v4) (pred_1 ))
:effect (and (pred_6 ?v13)
   (not (pred_5 ?v13 ?v4)) (not (pred_1 ))))


(:action op_2
:parameters (?v4 ?v6 ?v5)
:precondition (and (pred_7 ?v4) (pred_12 ?v6) (pred_12 ?v5)
                  (pred_8 ?v4) (pred_6 ?v5) (pred_5 ?v6 ?v4))
:effect (and (pred_6 ?v6) (pred_5 ?v5 ?v4)
        (not (pred_6 ?v5)) (not (pred_5 ?v6 ?v4))))

(:action op_4
:parameters (?v4 ?v13)
:precondition (and (pred_7 ?v4) (pred_12 ?v13) 
                  (pred_8 ?v4) (pred_6 ?v13))
:effect (and (pred_1 ) (pred_5 ?v13 ?v4) (not (pred_6 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_09 obj_02 obj_04 obj_08 obj_06 obj_01 obj_07 obj_13
    obj_11 obj_03
    obj_12 obj_10
    )

    (:init
       (pred_1)

       (pred_7 obj_05)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_04)
       (pred_7 obj_08)
       (pred_7 obj_06)
       (pred_7 obj_01)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_2 obj_11)
       (pred_2 obj_03)
       (pred_12 obj_12)
       (pred_12 obj_10)

       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_02 obj_06)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_08 obj_07)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_06 obj_13)
       (pred_4 obj_06 obj_02)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_08)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_13 obj_06)
       (pred_4 obj_13 obj_07)
       (pred_11 obj_05)
       (pred_11 obj_13)
       (pred_9  obj_05 obj_11)
       (pred_9  obj_13 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_01)
       (pred_10 obj_07)

       (pred_3  obj_12 obj_11)
       (pred_3  obj_10 obj_03)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_10 obj_06)
       (pred_8 obj_06)
    )

    (:goal (and
       (pred_5 obj_12 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_3 obj_06 obj_02)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_02)
   goals met: 0 of 1
2. (op_5 obj_02 obj_12)
   deleted: (pred_5 obj_12 obj_02) (pred_1)
   added: (pred_6 obj_12)
   goals met: 0 of 1
3. (op_3 obj_02 obj_06)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_06)
   goals met: 0 of 1
4. (op_3 obj_06 obj_08)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_08)
   goals met: 0 of 1
5. (op_3 obj_08 obj_04)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_04)
   goals met: 0 of 1
6. (op_4 obj_04 obj_12)
   deleted: (pred_6 obj_12)
   added: (pred_1) (pred_5 obj_12 obj_04)
   goals met: 1 of 1
